[
  {
    "post_id": 1,
    "text": "What an Epic Day at Odoo 🤯\n\n\nMet,who built this $5.3B company from Gandhinagar in Gujarat.\n\nLast week, I attended Odoo Community Days 2025 with more than 20K+ attendees. There were keynote sessions and panel discussions by entrepreneurs like(Boat) and creators like,and many more.\n\nOdoo had some amazing updates as were shared in the keynote by Fabien. The event also had 240+ talks, masterclasses and fireside chats. Events like these help us identify ourselves better and strive for the best.\n\nGot a chance to meet so many of you. Witnessed booths by 200+ partners and also they organized Odoo Hackathon and a Business Challenge for the students.\n\nTruly enjoyed my time at OCD 2025 and thanks to the team at Odoo for putting this together so well.\n\nExcited for Odoo Community Days 2026.",
    "likes": 328,
    "comments": 0,
    "reposts": 0,
    "engagement": 328,
    "scraped_at": "2025-08-20T21:47:08.819004",
    "source": "profile",
    "profile_url": "https://www.linkedin.com/in/arshgoyal/"
  },
  {
    "post_id": 2,
    "text": "Just last week, I spent 2 hours trying to understand a complex PR from my teammate - commit history, jumping between files, and still feeling lost about the logic flow.\n\nThis is exactly why I'm excited about getting early access toChat.\n\nInstead of context-switching between my IDE, GitHub, and Slack to understand code changes, I can now just ask Graphite directly. It has the full context of my codebase history and can even search the web when needed.\n\nSome things that this Graphite AI Chat offers:\n- Instant code explanations - It highlights any lines and gets step-by-step breakdowns.\n- Proactive risk detection - This flags performance issues and logic bugs before review.\n- Direct PR fixes - It applies suggested changes automatically to your branch.\n- CI failure diagnosis - This feature understands your CI context and suggests fixes.\n- Comment resolution - It helps address feedback from both AI and human reviewers.\n\nWhat I love most is how it removes the friction from code review.\n\nGraphite is now a complete code review platform, and honestly, this feels like the missing piece that makes the whole experience seamless.\n\nDevelopers building solo or in teams - this is worth checking out. I also created a short demo below, checkout here:",
    "likes": 265,
    "comments": 0,
    "reposts": 2,
    "engagement": 267,
    "scraped_at": "2025-08-20T21:47:09.009369",
    "source": "profile",
    "profile_url": "https://www.linkedin.com/in/arshgoyal/"
  }
]