{
  "identifier": "amanbhutani",
  "type": "profile",
  "scraped_at": "2025-08-25T18:14:15.840499+05:30",
  "total_posts": 2,
  "posts": [
    {
      "id": "Introducing...GoDaddy Future of Work Summer Camp: _93",
      "text": "Introducing...GoDaddy Future of Work Summer Camp: Your Launchpad for a Career in Sales and Tech! Are you passionate about connecting with people, excited to learn, and ready to sell? We’re seeking confident communicators eager for real-world sales experience and the chance to empower others! At camp, you’ll: 🗣️ Pitch & Sell: Become a local ambassador—help students, clubs, and creators launch their digital presence with easy-to-use website and domain solutions. 👏 Get Hands-On with AI: Discover how AI can enhance your sales skills and help customers build impactful websites. 😎 Sharpen Your Sales Game: Master outreach, pitching, and closing deals with real customers. 🛜 Lead the Future: Help others turn their passions into reality and own a piece of the internet. If you’re ready to kickstart your career in sales and entrepreneurship, apply now and shape the future! https://lnkd.in/g_Bv_VWD hashtag #Sales hashtag #FutureOfWork hashtag #GoDaddySummerCamp hashtag #Entrepreneur hashtag #AI Aman Bhutani Oliver Hoare Alexandra Jasinski Suzeth C. Thea B. Erin Walsh-Beguin Fara Howard GoDaddy",
      "likes": 93,
      "comments": 7,
      "reposts": 5,
      "engagement": 105,
      "scraped_at": "2025-08-25T18:14:14.532935+05:30",
      "source": "profile",
      "profile_url": "https://www.linkedin.com/in/amanbhutani/"
    },
    {
      "id": "A few weeks ago two freshmen at UW, Prabhgun Basi _228",
      "text": "A few weeks ago two freshmen at UW, Prabhgun Basi and Akalsukh Basi, shared with me that it was hard to find a productive project for the summer. Turns out this is true for a lot of students. The GoDaddy People Ops team has done a fantastic job creating a 'summer camp' focused on aspiring high schoolers, freshmen and sophomores at college where they get to experience the 'Future of Work' using AI in every part of their role. I am super excited about this and plan to run one of the tracks as part of this. We are all excited to create a productive summer for lots of young students - https://lnkd.in/gVN-pmst",
      "likes": 228,
      "comments": 31,
      "reposts": 21,
      "engagement": 280,
      "scraped_at": "2025-08-25T18:14:15.253693+05:30",
      "source": "profile",
      "profile_url": "https://www.linkedin.com/in/amanbhutani/"
    }
  ]
}